#include "sys.h"
#include "dcmi.h" 
#include "lcd.h" 
#include "led.h" 
#include "ov2640.h" 
//////////////////////////////////////////////////////////////////////////////////	 
//ALIENTEK STM32F407开发板
//DCMI 驱动代码	   
//正点原子@ALIENTEK
//技术论坛:www.openedv.com
//All rights reserved	
//********************************************************************************
//V1.1 20140516
//修改DCMI_DMA_Init函数，支持双缓冲模式
//////////////////////////////////////////////////////////////////////////////////	 








